Linux/LinuxOS/Ubuntu12.04配置.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>折腾Ubuntu 12.04</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="折腾Ubuntu 12.04"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-10 16:44:30 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#linuxos"> HOME </a>
</div>


<div id="content">
<h1 class="title">折腾Ubuntu 12.04</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>
<script src="../../Layout/JS/disqus-comment.js"></script>


<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Ctrl+Super快捷键：</a></li>
<li><a href="#sec-2">2 Alt快捷键</a></li>
<li><a href="#sec-3">3 鼠标快捷键</a></li>
<li><a href="#sec-4">4 Navigation</a></li>
<li><a href="#sec-5">5 Window Minimize and Maximize 默认</a></li>
<li><a href="#sec-6">6 安装gnome-shell-extension</a></li>
<li><a href="#sec-7">7 安装gnome-tweak-tool</a></li>
<li><a href="#sec-8">8 安装dconf-editor</a></li>
<li><a href="#sec-9">9 关掉烦人的错误报告</a></li>
<li><a href="#sec-10">10 设置Application中图标大小和间距</a></li>
<li><a href="#sec-11">11 apt-fast/apt-proz/apt-metalink</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ctrl+Super快捷键：</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Ctrl+Super+Up 键：最大化当前窗口<br/>
</li>
<li>Ctrl+Super+Down键：最小化当前窗口<br/>
</li>
<li>Ctrl+Super+D：最小化所有窗口<br/>
</li>
<li>Ctrl+Super+Left：半最大化当前窗口（左边）<br/>
</li>
<li>Ctrl+Super+Right：半最大化当前窗口（右边）<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Alt快捷键</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Alt+F1 –将键盘焦点移到Launcher上，使用箭头键进行移动，按回车即可启动一个应用程序，按下右箭头键显示Quicklist。<br/>
</li>
<li>Alt+F2 –以特殊模式打开dash，以便运行任何命令。<br/>
</li>
<li>Alt+F10 – 在最大化/非最大化之间切换当前窗口。<br/>
</li>
<li>Alt+F9 – 最小化当前窗口。<br/>
</li>
<li>Alt+Tab – 在当前打开的窗口之间切换。<br/>
</li>
<li>Alt+F4 – 关闭当前窗口。<br/>
</li>
<li>Alt+F7 –移动当前窗口（可以使用键盘或鼠标移动）。<br/>
</li>
</ul>


<p><br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 鼠标快捷键</h2>
<div class="outline-text-2" id="text-3">

<p>  将鼠标移动到最左上角 相当于按下win键<br/>
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Navigation</h2>
<div class="outline-text-2" id="text-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"><b>Screenshot</b></th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="left">Print</td><td class="left">Take a screenshot</td></tr>
<tr><td class="left">Alt+Print</td><td class="left">screenshot on a window</td></tr>
<tr><td class="left">Shitft+Print</td><td class="left">screenshot on a area</td></tr>
<tr><td class="left">Ctrl+Print</td><td class="left">copy screenshot to clipboard</td></tr>
<tr><td class="left">Ctrl+Alt+Print</td><td class="left">copy screenshot of a windows to clipboard</td></tr>
<tr><td class="left">Ctrl+Shit+Print</td><td class="left">copy screenshot of a area to clipboard</td></tr>
</tbody>
<tbody>
<tr><td class="left"><b>System</b></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Log out</td><td class="left">Ctrl+Alt+Delete</td></tr>
<tr><td class="left">Alt+F1 or Win</td><td class="left">show activities overview</td></tr>
</tbody>
<tbody>
<tr><td class="left"><b>Window</b></td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Alt+Escape</td><td class="left">Switch windows directly</td></tr>
<tr><td class="left">Ctrl+Super+D</td><td class="left">hide all windows</td></tr>
<tr><td class="left">Ctrl+F10</td><td class="left">Toggle fullsceen mode</td></tr>
<tr><td class="left">Ctrl+Alt+S</td><td class="left">Toggle maximization state</td></tr>
<tr><td class="left">Ctrl+Super+Down</td><td class="left">Restore Window</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Window Minimize and Maximize 默认</h2>
<div class="outline-text-2" id="text-5">

<ol>
<li>Minimize window: Ctrl+Alt+numpad 0<br/>
</li>
<li>Maxminze window: Super+Up   <br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 安装gnome-shell-extension</h2>
<div class="outline-text-2" id="text-6">

<p>  官网 <a href="http://extensions.gnome.org">http://extensions.gnome.org</a> 安装（安装方法 每个可安装程序旁边有个on/off 点击on即可）<br/>
  我现在正在使用的扩展：<br/>
</p><ol>
<li>Alternative Status Menu: 新加一个power off选项（点击后可出现restart选项）<br/>
</li>
<li>Application Menu: 增加一个类似gnome2的菜单<br/>
</li>
<li>Hide Dash: 隐藏Dash（按Win键出现的最左边的竖条 没什么用）<br/>
</li>
<li>Maximus: 最大化（不是全屏）隐藏标题栏<br/>
</li>
<li>Media Player Indicator: 播放音乐的时候，panel上的音量控制比平时丰富<br/>
</li>
<li>Panel Setting: 在panel上的用户名下面多一个system setting<br/>
</li>
<li>Places Status Indicator: 音量旁边增加一个类似gnome2中的文件夹按钮<br/>
</li>
<li>Remove Accessibility: 删掉panel上的accessibility按钮（没什么用）<br/>
</li>
<li>Move Clock: 将时钟移到用户名的左边而非正中间<br/>
</li>
<li>Status only icon: 去掉用户名，只显示一个按钮<br/>
</li>
<li>Brightness Control: 控制显示器亮度<br/>
</li>
</ol>

<p>  非gnome官方安装：<br/>
  添加更新源：<br/>
  sudo add-apt-repository ppa:upubuntu-com/ext<br/>
  sudo apt-get update<br/>
</p><ol>
<li>自动隐藏top panel: sudo apt-get install autohidetopbar-ext 双击调出<br/>
</li>
<li>将top panel移到下面：sudo apt-get install reflection-ext<br/>
     将完之后可以在gnome-tweak-tool－&gt;shell extensions中启用 然后Alt+F2 r Enter重新加载gnome-shell<br/>
</li>
</ol>

<p>  参考 <a href="http://www.upubuntu.com/2012/05/collection-of-20-top-extensions-for.html">http://www.upubuntu.com/2012/05/collection-of-20-top-extensions-for.html</a><br/>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 安装gnome-tweak-tool</h2>
<div class="outline-text-2" id="text-7">

<p>  可以设置主题<br/>
  shell-&gt;Arrangement of buttons on the titlebar-&gt;all<br/>
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 安装dconf-editor</h2>
<div class="outline-text-2" id="text-8">

<p>  整个gnome-shell的配置数据库（相当于win下的注册表）<br/>
  有些快捷键在system-setting-&gt;keyboard中设置没用，可以在dconf-editor中设置：<br/>
  org-&gt;gnome-&gt;desktop-&gt;wm-&gt;keybindings<br/>
  例如我把 minmize设置为 '&lt;Control&gt;&lt;Alt&gt;x‘ 即C-M-x即可最小窗口<br/>
  close： '&lt;Control&gt;&lt;Alt&gt;z' 即C-M-z关闭窗口<br/>
  有了这两个快捷键就不必在gnome-tweak-&gt;shell-&gt;Arrangment of buttons on the titlebar中设置最大最小化(最大化为Alt+F10 or Win-Up)<br/>
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 关掉烦人的错误报告</h2>
<div class="outline-text-2" id="text-9">

<p>  sudo emacs /etc/default/apport 将enabled=1改为enabled=0即可，退出 sudo service apport restart<br/>
</p></div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 设置Application中图标大小和间距</h2>
<div class="outline-text-2" id="text-10">

<p>  在/usr/share/gnome-shell/theme/gnome-shell.css中查找 grid。设置<br/>
</p>
<p><br/>
<pre class="src src-css">-shell-grid-horizontal-item-size: 100px;
-shell-grid-vertical-item-size: 100px;

-shell-grid-horizontal-item-size: 272px; <span style="color: #b22222;">/* </span><span style="color: #b22222;">2 * -shell-grid-horizontal-item-size + spacing </span><span style="color: #b22222;">*/</span>
-shell-grid-vertical-item-size: 118px;
</pre>

  即可。<br/>
</p></div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> apt-fast/apt-proz/apt-metalink</h2>
<div class="outline-text-2" id="text-11">

<p>  替代apt-get来加速下载<br/>
</p>
<p><br/>
<pre class="example">sudo sudo apt-add-repository ppa:tldm217/tahutek.net
sudo apt-get update
sudo apt-get install apt-proz
</pre>



<pre class="example">sudo add-apt-repository ppa:tldm217/tahutek.net 
sudo apt-get update 
sudo apt-get install apt-fast
</pre>


</p></div>
</div>
</div>

</body>
</html>
